Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: When doing step #2 and #5, make sure no other thread is accessing foo.
it_it: Quando si eseguono i passi #2 e #5, nessun altro thread deve accedere a foo.

source: When doing step #2 and #5, make sure no other thread is accessing `foo`.
it_it: Quando si eseguono i passi #2 e #5, nessun altro thread deve accedere a `foo`.

source: When gMock detects a failure, it prints relevant information (the mock function arguments, the state of relevant expectations, and etc) to help the user debug.
it_it: Quando gMock rileva un errore, stampa le informazioni rilevanti (gli argomenti della funzione mock, lo stato delle expectation rilevanti, ecc.) per aiutare l'utente a eseguire il debug.

source: When gMock sees something that has the potential of being an error (e.g. a mock function with no expectation is called, a.k.a.
it_it: Quando gMock vede qualcosa che potrebbe essere un errore (ad esempio viene chiamata una funzione mock senza una expectation, ovvero

source: When invoked, the RUN_ALL_TESTS() macro:
it_it: Quando viene richiamata, la macro RUN_ALL_TESTS():

source: When invoked, the `RUN_ALL_TESTS()` macro:
it_it: Quando viene richiamata, la macro `RUN_ALL_TESTS()`:

source: When it's being destroyed, your friendly mock object will automatically verify that all expectations on it have been satisfied, and will generate googletest failures if not.
it_it: Quando verrà distrutto, l'oggetto mock verificherà automaticamente che tutte le sue expectation siano state soddisfatte e, in caso contrario, genererà errori di googletest.

source: When matching the argument, you may not want to compare the entire object against a fixed object, as that may be over-specification.
it_it: Quando si esegue il matching di argomenti, si potrebbe non voler confrontare l'intero oggetto con un oggetto fisso, poiché ciò potrebbe essere eccessivo.

source: When mocking a class template, the macro name must be suffixed with _T.
it_it: Quando si crea il mock di una classe template, il nome della macro deve avere il suffisso _T.

source: When mocking a class template, the macro name must be suffixed with `_T`.
it_it: Quando si crea il mock di una classe template, il nome della macro deve avere il suffisso `_T`.

source: When mocking a const method, one must use MOCK_CONST_METHODn.
it_it: Quando si crea il mock di un metodo const, è necessario utilizzare MOCK_CONST_METHODn.

source: When mocking a const method, one must use `MOCK_CONST_METHODn`.
it_it: Quando si crea il mock di un metodo const, è necessario utilizzare `MOCK_CONST_METHODn`.

source: When multiple tests in a test suite need to share common objects and subroutines, you can put them into a test fixture class.
it_it: Quando più test, in una test suite, devono condividere oggetti e subroutine comuni, si possono inserire in una classe test fixture.

source: When multiple tests in a test suite need to share common objects and subroutines, you can put them into a *test fixture* class.
it_it: Quando più test, in una test suite, devono condividere oggetti e subroutine comuni, si possono inserire in una classe *test fixture*.

source: When naming your test suites and tests, you should follow the same convention as for naming functions and classes.
it_it: Quando si dà un nome alle test suite e ai test, si deve seguire la stessa convenzione usata per denominare funzioni e classi.

source: When naming your test suites and tests, you should follow the same convention as for [naming functions and classes](https://google.github.io/styleguide/cppguide.html#Function_Names).
it_it: Quando si dà un nome alle test suite e ai test, si deve seguire la stessa convenzione usata per [denominare funzioni e classi](https://google.github.io/styleguide/cppguide.html#Function_Names).

source: When not in debug mode (i.e. NDEBUG is defined), just executes statement.
it_it: Quando non è in modalità debug (cioè NDEBUG è definito), esegue semplicemente statement.

source: When not in debug mode (i.e. `NDEBUG` is defined), just executes *`statement`*.
it_it: Quando non è in modalità debug (cioè `NDEBUG` è definito), esegue semplicemente *`statement`*.

source: When people complain about this, often they are referring to code like:
it_it: Quando le persone si lamentano di questo, spesso si riferiscono a codici come:

source: When running test programs under a debugger, it's very convenient if the debugger can catch an assertion failure and automatically drop into interactive mode.
it_it: Quando si eseguono programmi di test in un debugger, è molto conveniente che il debugger possa rilevare un errore di asserzione e passare automaticamente alla modalità interattiva.

source: When someone implements the interface, they can instantiate your suite to get all the interface-conformance tests for free.
it_it: Quando qualcuno implementa l'interfaccia, può creare un'istanza della suite per ottenere gratuitamente tutti i test di conformità dell'interfaccia.

source: When tests fail, they should provide as much *information* about the problem as possible.
it_it: Quando i test falliscono, dovrebbero fornire quante più *informazioni* possibili sul problema.

source: When tests fail, they should provide as much information about the problem as possible.
it_it: Quando i test falliscono, dovrebbero fornire quante più informazioni possibili sul problema.

source: When the assertion fails, you already know that ptr must be NULL, so it doesn't add any information to print ptr in this case.
it_it: Quando l'asserzione fallisce, si sa già che ptr deve essere NULL, quindi non aggiunge alcuna informazione per stampare ptr in questo caso.

source: When the assertion fails, it prints the value of each argument.
it_it: Quando l'asserzione fallisce, stampa il valore di ciascun argomento.

source: When the assertion fails, you already know that `ptr` must be `NULL`, so it doesn't add any information to print `ptr` in this case.
it_it: Quando l'asserzione fallisce, si sa già che `ptr` deve essere `NULL`, quindi non aggiunge alcuna informazione per stampare `ptr` in questo caso.

source: When the assertion wasn't successful, the AssertionResult object stores a non-empty failure message that can be retrieved with the object's message() method.
it_it: Quando l'asserzione non ha avuto successo, l'oggetto AssertionResult memorizza un messaggio di errore non vuoto recuperabile col metodo message() dell'oggetto.

source: When the assertion wasn't successful, the `AssertionResult` object stores a non-empty failure message that can be retrieved with the object's `message()` method.
it_it: Quando l'asserzione non ha avuto successo, l'oggetto `AssertionResult` memorizza un messaggio di errore non vuoto recuperabile col metodo `message()` dell'oggetto.

source: When the last action that references the implementation object dies, the implementation object will be deleted.
it_it: Quando l'ultima azione che fa riferimento all'oggetto di implementazione muore, l'oggetto di implementazione verrà eliminato.

source: When the last matcher that references the implementation object dies, the implementation object will be deleted.
it_it: Quando l'ultimo matcher che fa riferimento all'oggetto di implementazione muore, l'oggetto di implementazione verrà eliminato.

source: When the value is auto, GoogleTest will use colors if and only if the output goes to a terminal and (on non-Windows platforms) the TERM environment variable is set to xterm or xterm-color.
it_it: Quando il valore è auto, GoogleTest utilizzerà i colori se e solo se l'output arriva a un terminale e (su piattaforme non Windows) la variabile di ambiente TERM è settata a xterm o a xterm-color.

source: When the value is `auto`, GoogleTest will use colors if and only if the output goes to a terminal and (on non-Windows platforms) the `TERM` environment variable is set to `xterm` or `xterm-color`.
it_it: Quando il valore è `auto`, GoogleTest utilizzerà i colori se e solo se l'output arriva a un terminale e (su piattaforme non Windows) la variabile di ambiente `TERM` è settata a `xterm` o a `xterm-color`.

source: When these tests run, the following happens:
it_it: Quando vengono eseguiti questi test, accade quanto segue:

source: When used with WillOnce, the callable can assume it will be called at most once and is allowed to be a move-only type:
it_it: Se utilizzato con WillOnce, il callable può presupporre che verrà chiamato al massimo una volta e può essere di tipo move-only:

source: When used with `WillOnce`, the callable can assume it will be called at most once and is allowed to be a move-only type:
it_it: Se utilizzato con `WillOnce`, il callable può presupporre che verrà chiamato al massimo una volta e può essere di tipo move-only:

source: When using GoogleTest, you start by writing *assertions*, which are statements that check whether a condition is true.
it_it: Quando si usa GoogleTest, si comincia scrivendo *asserzioni*, ovvero affermazioni che verificano se una condizione è vera.

source: When using GoogleTest, you start by writing assertions, which are statements that check whether a condition is true.
it_it: Quando si usa GoogleTest, si comincia scrivendo asserzioni, ovvero affermazioni che verificano se una condizione è vera.

source: When using a fixture, use TEST_F() instead of TEST() as it allows you to access objects and subroutines in the test fixture:
it_it: Quando si usa una fixture, si usa TEST_F() anziché TEST() in quanto consente di accedere a oggetti e subroutine nella fixture di test:

source: When using a fixture, use `TEST_F()` instead of `TEST()` as it allows you to access objects and subroutines in the test fixture:
it_it: Quando si usa una fixture, si usa `TEST_F()` anziché `TEST()` in quanto consente di accedere a oggetti e subroutine nella fixture di test:

source: When using gMock,
it_it: Quando si usa gMock,

source: When using testing doubles (mocks, fakes, stubs, and etc), sometimes their behaviors will differ from those of the real objects.
it_it: Quando si utilizzano copie di test (mock, fake, stub e così via), a volte i loro comportamenti differiranno da quelli degli oggetti reali.

source: When using typed tests, you need to make sure you are testing against the interface type, not the concrete types (in other words, you want to make sure implicit_cast<MyInterface*>(my_concrete_impl) works, not just that my_concrete_impl works).
it_it: Quando si usano test tipizzati, si deve eseguire il test rispetto al tipo di interfaccia, non ai tipi concreti (in altre parole, implicit_cast<MyInterface*>(my_concrete_impl) deve funzionare, non basta che funzioni my_concrete_impl).

source: When using typed tests, you need to make sure you are testing against the interface type, not the concrete types (in other words, you want to make sure `implicit_cast<MyInterface*>(my_concrete_impl)` works, not just that `my_concrete_impl` works).
it_it: Quando si usano test tipizzati, si deve eseguire il test rispetto al tipo di interfaccia, non ai tipi concreti (in altre parole, `implicit_cast<MyInterface*>(my_concrete_impl)` deve funzionare, non basta che funzioni `my_concrete_impl`).

source: When you refactor your code without changing its externally visible behavior, ideally you shouldn't need to update any tests.
it_it: Quando si esegue il refactoring del codice senza modificarne il comportamento visibile dall'esterno, idealmente si dovrebbe aver bisogno di aggiornare alcun test.

source: When you add listeners to the listener list, you should put listeners that handle OnTestPartResult() before listeners that can generate failures.
it_it: Quando si aggiungono listener alla lista, si devono inserire i listener che gestiscono OnTestPartResult() prima di quelli che generano errori.

source: When you add listeners to the listener list, you should put listeners that handle `OnTestPartResult()` *before* listeners that can generate failures.
it_it: Quando si aggiungono listener alla lista, si devono inserire i listener che gestiscono `OnTestPartResult()` *prima* di quelli che generano errori.

source: When you define a mock class, you need to decide where to put its definition.
it_it: Quando si definisce una classe mock, si deve decidere dove inserire la sua definizione.

source: When you define the mock class using gMock, you can have it delegate its default action to a fake class you already have, using this pattern:
it_it: Quando si definisce la classe mock utilizzando gMock, si può far sì che deleghi la sua azione di default a una classe fake che già si possiede, utilizzando questo pattern:

source: When you do an EXPECT_CALL(mock_obj, Foo(bar)), gMock saves away a copy of bar.
it_it: Quando si esegue un EXPECT_CALL(mock_obj, Foo(bar)), gMock salva una copia di bar.

source: When you do an `EXPECT_CALL(mock_obj, Foo(bar))`, gMock saves away a copy of `bar`.
it_it: Quando si esegue un `EXPECT_CALL(mock_obj, Foo(bar))`, gMock salva una copia di `bar`.

source: When you need to write per-test set-up and tear-down logic, you have the choice between using the test fixture constructor/destructor or SetUp()/TearDown().
it_it: Quando è necessario scrivere la logica di configurazione e ripulitura per ciascun test, è possibile scegliere tra utilizzare il costruttore/distruttore della fixture o SetUp()/TearDown().

source: When you need to write per-test set-up and tear-down logic, you have the choice between using the test fixture constructor/destructor or `SetUp()`/`TearDown()`.
it_it: Quando è necessario scrivere la logica di configurazione e ripulitura per ciascun test, è possibile scegliere tra utilizzare il costruttore/distruttore della fixture o `SetUp()`/`TearDown()`.

source: When you write Foo(v1, ..., vk), the compiler infers the types of the parameters v1, ..., and vk for you.
it_it: Scrivendo Foo(v1, ..., vk), il compilatore deduce i tipi dei parametri v1, ..., e vk autonomamente.

source: When you write `Foo(v1, ..., vk)`, the compiler infers the types of the parameters `v1`, ..., and `vk` for you.
it_it: Scrivendo `Foo(v1, ..., vk)`, il compilatore deduce i tipi dei parametri `v1`, ..., e `vk` autonomamente.

source: When you write a prototype or test, often it's not feasible or wise to rely on real objects entirely.
it_it: Quando si scrive un prototipo o un test, spesso non è fattibile o saggio affidarsi interamente a oggetti reali.

source: When you write a test without using mocks, you exercise the code and assert that it returns the correct value or that the system is in an expected state.
it_it: Quando si scrive un test senza utilizzare mock, si sollecita il codice e si afferma che restituisce il valore corretto o che il sistema è in uno stato previsto.

source: Whenever a GoogleTest flag is seen, it is removed from argv, and *argc is decremented.
it_it: Ogni volta che viene visualizzato un flag di GoogleTest, viene rimosso da argv e *argc viene decrementato.

source: Whenever a GoogleTest flag is seen, it is removed from `argv`, and `*argc` is decremented.
it_it: Ogni volta che viene visualizzato un flag di GoogleTest, viene rimosso da `argv`, e `*argc` viene decrementato.

source: Whenever you derive from a base class, make sure its destructor is virtual.
it_it: Ogni volta che si deriva da una classe base, assicurarsi che il suo distruttore sia virtuale.

source: Where to Put It
it_it: Dove Metterlo

source: Whether you work on Linux, Windows, or a Mac, if you write C++ code, GoogleTest can help you.
it_it: Sia se si lavora su Linux, su Windows, o su Mac, se si scrive codice C++, GoogleTest può essere utile.

source: While EXPECT_PRED*() and friends are handy for a quick job, the syntax is not satisfactory: you have to use different macros for different arities, and it feels more like Lisp than C++.
it_it: Sebbene EXPECT_PRED*() e similli siano utili per un lavoro veloce, la sintassi non è soddisfacente: si devono usare macro diverse per caratteristiche diverse, e sembra più Lisp che C++.

source: While `EXPECT_PRED*()` and friends are handy for a quick job, the syntax is not satisfactory: you have to use different macros for different arities, and it feels more like Lisp than C++.
it_it: Sebbene `EXPECT_PRED*()` e similli siano utili per un lavoro veloce, la sintassi non è soddisfacente: si devono usare macro diverse per caratteristiche diverse, e sembra più Lisp che C++.

source: While it's tempting to always use the MATCHER* macros when defining a new matcher, you should also consider implementing the matcher interface directly instead (see the recipes that follow), especially if you need to use the matcher a lot.
it_it: Sebbene sia forte la tentazione di utilizzare sempre le macro MATCHER* quando si definisce un nuovo matcher, di dovrebbe anche considerare di implementare direttamente l'interfaccia del matcher (vedere le ricette che seguono), soprattutto se c'è bisogno di usare molto il matcher.

source: While it's tempting to always use the `MATCHER*` macros when defining a new matcher, you should also consider implementing the matcher interface directly instead (see the recipes that follow), especially if you need to use the matcher a lot.
it_it: Sebbene sia forte la tentazione di utilizzare sempre le macro `MATCHER*` quando si definisce un nuovo matcher, di dovrebbe anche considerare di implementare direttamente l'interfaccia del matcher (vedere le ricette che seguono), soprattutto se c'è bisogno di usare molto il matcher.

source: While mock objects help you remove unnecessary dependencies in tests and make them fast and reliable, using mocks manually in C++ is hard:
it_it: Sebbene gli oggetti mock aiutino a rimuovere le dipendenze non necessarie nei test e a renderli veloci e affidabili, usare i mock manualmente in C++ è difficile:

source: While mock objects help you remove unnecessary dependencies in tests and make them fast and reliable, using mocks manually in C++ is *hard*:
it_it: Sebbene gli oggetti mock aiutino a rimuovere le dipendenze non necessarie nei test e a renderli veloci e affidabili, usare i mock manualmente in C++ è *difficile*:

source: While one can argue that it's the user's fault, gMock tries to be nice and prints you a note.
it_it: Anche se si può sostenere che è colpa dell'utente, gMock cerca di essere gentile e stampa una nota.

source: While the ACTION* macros are very convenient, sometimes they are inappropriate.
it_it: Sebbene le macro ACTION* siano molto comode, a volte sono inappropriate.

source: While the `ACTION*` macros are very convenient, sometimes they are inappropriate.
it_it: Sebbene le macro `ACTION*` siano molto comode, a volte sono inappropriate.

source: While the two types aren't exactly the same, there is nothing really wrong with using a Matcher<long> to match an int - after all, we can first convert the int argument to a long losslessly before giving it to the matcher.
it_it: Sebbene i due tipi non siano esattamente gli stessi, non c'è niente di veramente sbagliato nell'usare un Matcher<long> per abbinare un int - dopo tutto, possiamo convertire prima l'argomento int in un long senza perdere informazioni prima di passarlo al matcher.

source: While the two types aren't exactly the same, there is nothing really wrong with using a `Matcher<long>` to match an `int` - after all, we can first convert the `int` argument to a `long` losslessly before giving it to the matcher.
it_it: Sebbene i due tipi non siano esattamente gli stessi, non c'è niente di veramente sbagliato nell'usare un `Matcher<long>` per abbinare un `int` - dopo tutto, possiamo convertire prima l'argomento `int` in un `long` senza perdere informazioni prima di passarlo al matcher.

source: While these approaches require more work, they give you more control on the types of the value being matched and the matcher parameters, which in general leads to better compiler error messages that pay off in the long run.
it_it: Sebbene questi approcci richiedano più lavoro, offrono un maggiore controllo sui tipi del valore da abbinare e sui parametri del matcher, il che in generale porta a messaggi di errore del compilatore migliori che ripagano nel lungo periodo.

source: While this is more work initially, carefully choosing the adaptor interface can make your code easier to write and more readable (a net win in the long run), as you can choose FooAdaptor to fit your specific domain much better than Foo does.
it_it: Anche se inizialmente questo richiede più lavoro, scegliere attentamente l'interfaccia dell'adattatore [adaptor] può rendere il codice più facile da scrivere e più leggibile (un vantaggio netto a lungo termine), poiché si può scegliere FooAdaptor per adattarlo maggiormente al dominio specifico meglio di Foo.

source: While this is more work initially, carefully choosing the adaptor interface can make your code easier to write and more readable (a net win in the long run), as you can choose `FooAdaptor` to fit your specific domain much better than `Foo` does.
it_it: Anche se inizialmente questo richiede più lavoro, scegliere attentamente l'interfaccia dell'adattatore [adaptor] può rendere il codice più facile da scrivere e più leggibile (un vantaggio netto a lungo termine), poiché si può scegliere `FooAdaptor` per adattarlo maggiormente al dominio specifico meglio di `Foo`.

source: While you can instantiate a matcher template with reference types, passing the parameters by pointer usually makes your code more readable.
it_it: Sebbene sia possibile creare un'istanza di un template matcher con tipi riferimento, il passaggio dei parametri tramite puntatore in genere rende il codice più leggibile.

source: While you can write one TEST or TEST_F for each type you want to test (and you may even factor the test logic into a function template that you invoke from the TEST), it's tedious and doesn't scale: if you want m tests over n types, you'll end up writing m*n TESTs.
it_it: Anche se si può scrivere un TEST o TEST_F per ogni tipo da testare (e si potrebbe anche fattorizzare la logica del test in una funzione template invocata da TEST), è noioso e non scalabile: se si vuole che m test su n tipi, si finirà per scrivere m*n TEST.

source: While you can write one `TEST` or `TEST_F` for each type you want to test (and you may even factor the test logic into a function template that you invoke from the `TEST`), it's tedious and doesn't scale: if you want `m` tests over `n` types, you'll end up writing `m*n` `TEST`s.
it_it: Anche se si può scrivere un `TEST` o `TEST_F` per ogni tipo da testare (e si potrebbe anche fattorizzare la logica del test in una funzione template invocata da `TEST`), è noioso e non scalabile: se si vuole che `m` test su `n` tipi, si finirà per scrivere `m*n` `TEST`.

source: Why do you need separate macros for floating point comparisons?
it_it: Perché sono necessarie macro separate per i confronti in virgola mobile?

source: Why does ASSERT_DEATH complain about previous threads that were already joined?
it_it: Perché ASSERT_DEATH dice che era già [joined] ai thread precedenti?

source: Why does GoogleTest require the entire test suite, instead of individual tests, to be named *DeathTest when it uses ASSERT_DEATH?
it_it: Perché GoogleTest richiede che l'intera test suite, anziché i singoli test, venga denominata *DeathTest quando usa ASSERT_DEATH?

source: Why does GoogleTest require the entire test suite, instead of individual tests, to be named `*DeathTest` when it uses `ASSERT_DEATH`?
it_it: Perché GoogleTest richiede che l'intera test suite, anziché i singoli test, venga denominata `*DeathTest` quando usa `ASSERT_DEATH`?

source: Why does GoogleTest support EXPECT_EQ(NULL, ptr) and ASSERT_EQ(NULL, ptr) but not EXPECT_NE(NULL, ptr) and ASSERT_NE(NULL, ptr)?
it_it: Perché GoogleTest supporta EXPECT_EQ(NULL, ptr) e ASSERT_EQ(NULL, ptr) ma non EXPECT_NE(NULL, ptr) e ASSERT_NE(NULL, ptr)?
